Tekla Open API Reference for Tekla Structures 2025
IHideable Interface
 The IHideable interface is used for each object that can be hidden in the drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IHideable
Public Interface IHideable
The IHideable type exposes the following members.
Properties
Name | Description
Hideable
 Accesses the information if this object is hidden or not or if it should be.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace